---
kind: method
id: M:Autodesk.Revit.DB.FabricationHostedInfo.DisconnectFromHost
source: html/22be6751-af02-cda5-11ca-3433835f3e94.htm
---
# Autodesk.Revit.DB.FabricationHostedInfo.DisconnectFromHost Method

Disconnects the part from the host.

## Syntax (C#)
```csharp
public void DisconnectFromHost()
```